In [ ]:
# Install MySql packages
# ! conda update -n base -c conda-forge conda
!pip install ipython-sql
!pip install mysql-connector-python
!conda install -c conda-forge python-dotenv --yes

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import statsmodels as sm
import mysql.connector
from mysql.connector import Error
from os import environ, path
from dotenv import load_dotenv

In [8]:
load_dotenv()
password = environ.get('PASSWORD')
host = environ.get('HOST')
database = environ.get('DATABASE')

In [9]:
try:
    connection = mysql.connector.connect(host=host ,
                                        database=database,
                                        user='root',
                                        password=password)
    if connection.is_connected():
        print("Succes Connected")
        
except Error as e:
    print("Error closing connection")
    
finally:
    pass

Succes Connected

In [10]:

df_names = pd.read_sql_query("SELECT * FROM music_and_death.musician;", connection)
df_death = pd.read_sql_query("SELECT * FROM music_and_death.death;", connection)

In [11]:
df

     musician_id first_name middle_name last_name             alias
0              1       John     Winston    Lennon              None
1              2       Kurt      Donald    Cobain              None
2              3    Freddie               Mercury              None
3              4     Darrel       Lance    Abbott           Dimebag
4              5    Randall     William    Rhoads             Randy
..           ...        ...         ...       ...               ...
104          105  Shubhdeep       Singh     Sidhu  Sidhu Moose Wala
105          106     Mariel     Semonte       Orr           Trouble
106          107   Javorius      Tykies     Scott      JayDaYoungan
107          108      Rakim     Hasheem     Allen          PnB Rock
108          109   Kirshnik       Khari      Ball           Takeoff

[109 rows x 5 columns]

In [21]:
df_death['death_age'].value_counts()

28    8
21    7
27    7
34    7
32    6
25    6
20    5
37    5
33    4
24    4
26    4
53    3
19    3
36    3
38    3
30    3
22    3
50    3
23    2
42    2
45    2
49    1
71    1
69    1
79    1
67    1
57    1
52    1
51    1
18    1
48    1
46    1
44    1
41    1
40    1
39    1
35    1
31    1
29    1
90    1
Name: death_age, dtype: int64